//=============================================================================
//
// タイトル処理 [title.h]
// Author : 俵谷 健太郎
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_TITLE	(1)
#define TITLE1_TEXTURE	"data/TEXTURE/title001.png"		// タイトル1のテクスチャパス
//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "scene.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene2D;

//*****************************************************************************
// タイトルクラス
//*****************************************************************************
class CTitle : public CScene
{
public:
	CTitle();									// コンストラクタ
	~CTitle();									// デストラクタ
	static HRESULT Load(void);					// テクスチャ読み込み
	static void Unload(void);					// テクスチャ破棄
	static CTitle *Create(D3DXVECTOR3 size);	// 作成処理
	HRESULT Init(D3DXVECTOR3 size);				// 初期化処理
	void Uninit(void);							// 終了処理
	void Update(void);							// 更新処理
	void Draw(void);							// 描画処理

private:
	static LPDIRECT3DTEXTURE9 m_apTexture;		// テクスチャのポインタ
	CScene2D *m_apScene2D;						// Scene2Dのポインタ
	D3DXVECTOR3 m_pos;							// 位置

};



#endif
