//=============================================================================
//
// ステージ3処理 [stage_3.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _STAGE_3_H_
#define _STAGE_3_H_

//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "main.h"
#include "stage.h"
//=============================================================================
//前方宣言
//=============================================================================
class CEnemy;

//=============================================================================
// クラス定義
//=============================================================================
class CStage3 :public CStage
{
public:

	CStage3();	//コンストラクタ
	~CStage3();	//デストラクタ
	static CStage3*	Create(void);	//生成処理

	HRESULT	Init(void);		// 初期化処理
	void	Uninit(void);	// 終了処理
	void	Update(void);	// 更新処理
	void	StageMode(void);	// ステージの進行

private:
	STAGE_ENEMY	m_EnemyCreate;		//エネミーの出現モード
	STAGE_DATA	m_StageData;		//エネミーの出現データ
	int			m_nBossPhase;		//ボス出現データ

};


#endif