//=============================================================================
//
// タイトル処理 [title.cpp]
// Author : 俵谷 健太郎
//
//=============================================================================
#include "title.h"
#include "manager.h"
#include "scene2d.h"


//=============================================================================
//静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CTitle::m_apTexture = NULL;


//=============================================================================
// コンストラクタ
//=============================================================================
CTitle::CTitle()
{
	if (m_apScene2D != NULL)
	{
		m_apScene2D = NULL;
	}
}

//=============================================================================
// デストラクタ
//=============================================================================
CTitle::~CTitle()
{
}

//=============================================================================
// テクスチャ読み込み
//=============================================================================
HRESULT CTitle::Load(void)
{
	//デバイスの取得
	LPDIRECT3DDEVICE9 pD3DDevice = CManager::GetRenderer()->GetDevice();
	// テクスチャの生成
	D3DXCreateTextureFromFile(pD3DDevice, TITLE1_TEXTURE, &m_apTexture);

	return S_OK;
}

//=============================================================================
// テクスチャ破棄
//=============================================================================
void CTitle::Unload(void)
{
	// テクスチャの破棄
	if (m_apTexture != NULL)
	{
		m_apTexture->Release();
		m_apTexture = NULL;
	}
}

//=============================================================================
// 作成処理
//=============================================================================
CTitle * CTitle::Create(D3DXVECTOR3 size)
{
	CTitle *pTitle;
	//インスタンス生成
	pTitle = new CTitle;

	//初期化処理
	if (pTitle != NULL)
	{
		pTitle->Init(size);
	}

	return pTitle;
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CTitle::Init(D3DXVECTOR3 size)
{
	if (m_apScene2D == NULL)
	{
		m_apScene2D = new CScene2D;
		//テクスチャ設定
		m_apScene2D->BindTexture(m_apTexture);
		//初期化処理
		m_apScene2D->Init(size);
		//位置取得
		m_pos = m_apScene2D->GetPosition();
		//位置設定
		m_pos = D3DXVECTOR3(SCREEN_CENTER_X, SCREEN_CENTER_Y, 0.0f);
		m_apScene2D->SetPosition(m_pos);
	}
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CTitle::Uninit(void)
{
	if (m_apScene2D != NULL)
	{
		m_apScene2D->Uninit();
		m_apScene2D = NULL;
	}
	Release();
}

//=============================================================================
// 更新処理
//=============================================================================
void CTitle::Update(void)
{

	if (m_apScene2D != NULL)
	{
		m_apScene2D->Update();
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void CTitle::Draw(void)
{
}
