//=============================================================================
//
// 死亡アニメーション処理 [death.h]
// Author : 俵谷 健太郎
//
//=============================================================================
#ifndef _DEATH_H_
#define _DEATH_H_


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define DEATH_TEXTURE	"data/TEXTURE/pipo-btleffect122.png"// アニメーションテクスチャパス
#define DEATH_ANIMATION (10)

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene2d.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************


//*****************************************************************************
// デスクラス
//*****************************************************************************
class CDeath : public CScene2D
{
public:
	CDeath();									// コンストラクタ
	~CDeath();									// デストラクタ
	static HRESULT Load(void);					// テクスチャ読み込み
	static void Unload(void);					// テクスチャ破棄
	static CDeath *Create(D3DXVECTOR3 size);	// 作成処理
	HRESULT Init(D3DXVECTOR3 size);				// 初期化処理
	void Uninit(void);							// 終了処理
	void Update(void);							// 更新処理
	void Draw(void);							// 描画処理

private:
	static LPDIRECT3DTEXTURE9 m_pTexture;		// テクスチャのポインタ
	D3DXVECTOR3 m_pos;							// 位置
	int m_nCountAnime;							// カウンター
	int m_nPatternAnime;						// パターンNo

};






#endif // !_DEATH_H_

