//=============================================================================
//
// 入力処理 [input.h]
// Author : 俵谷 健太郎
//
//=============================================================================
#ifndef _INPUT_H_
#define _INPUT_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "dinput.h"

//*****************************************************************************
//インプットクラス
//*****************************************************************************
class CInput
{
public:
	CInput();												// コンストラクタ
	virtual ~CInput();										// デストラクタ
	virtual HRESULT Init(HINSTANCE hInstance, HWND hWnd);	// 初期化処理
	virtual void Uninit(void);								// 終了処理
	virtual void Update(void) = 0;							// 更新処理

protected:
	LPDIRECTINPUTDEVICE8 m_pDevice;							// 入力デバイス（キーボード）へのポインタ
	static LPDIRECTINPUT8 m_pInput;							// Direct Inputオブジェクトへのポインタ

};



#endif // !_INPUT_H_









