//=============================================================================
//
// シーン処理 [scene.cpp]
// Author : 俵谷 健太郎
//
//=============================================================================
#include "scene.h"

//=============================================================================
//静的メンバ変数宣言
//=============================================================================
CScene *CScene::m_apScene[MAX_POLYGON] = {};
int CScene::m_nNumAll = 0;

//=============================================================================
// コンストラクタ
//=============================================================================
CScene::CScene()
{
	for (int nCountScene = 0; nCountScene < MAX_POLYGON; nCountScene++)
	{
		if (m_apScene[nCountScene] == NULL)
		{
			m_apScene[nCountScene] = this;
			m_nID = nCountScene;
			m_nNumAll++;
			break;
		}
	}
}

//=============================================================================
// デストラクタ
//=============================================================================
CScene::~CScene()
{
}

//=============================================================================
// 全オブジェクト更新処理
//=============================================================================
void CScene::UpdateAll(void)
{
	for (int nCount = 0; nCount < MAX_POLYGON; nCount++)
	{
		if (m_apScene[nCount] != NULL)
		{
			m_apScene[nCount]->Update();
		}
	}
}

//=============================================================================
// 全オブジェクト描画処理
//=============================================================================
void CScene::DrawAll(void)
{
	for (int nCount = 0; nCount < MAX_POLYGON; nCount++)
	{
		if (m_apScene[nCount] != NULL)
		{
			m_apScene[nCount]->Draw();
		}
	}
}

//=============================================================================
// 全オブジェクトリリース処理
//=============================================================================
void CScene::ReleaseAll(void)
{
	//終了処理
	for (int nCount = 0; nCount < MAX_POLYGON; nCount++)
	{
		if (m_apScene[nCount] != NULL)
		{
			m_apScene[nCount]->Uninit();
		}
	}
}

//=============================================================================
// シーンの取得
//=============================================================================
CScene * CScene::GetScene(int nNumber)
{
	return m_apScene[nNumber];
}

//=============================================================================
// オブジェクト設定
//=============================================================================
void CScene::SetObjType(OBJTYPE objType)
{
	m_objType = objType;
}

//=============================================================================
// オブジェクトリリース処理
//=============================================================================
void CScene::Release(void)
{
	if (m_apScene[m_nID] != NULL)
	{
		int nID = m_nID;
		delete m_apScene[nID];
		m_apScene[nID] = NULL;
		m_nNumAll--;
	}
}
