//=============================================================================
//
// メイン処理 [main.h]
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

#define _CRT_SECURE_NO_WARNINGS
#define DIRECTINPUT_VERSION (0x0800) //警告対処用

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <WinSock2.h>
#include <windows.h>
#include "d3dx9.h"
#include <stdio.h>

#include "xaudio2.h"
#include <thread>

//*****************************************************************************
// ライブラリファイルのリンク
//*****************************************************************************
#pragma comment(lib, "ws2_32.lib")
#pragma comment(lib, "d3d9.lib")
#pragma comment(lib, "d3dx9.lib")
#pragma comment(lib, "dxguid.lib")
#pragma comment(lib, "winmm.lib")
#pragma comment(lib, "dinput8.lib")

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	WINDOW_POS_X	(0)						// ウィンドウ初期値(横)
#define	WINDOW_POS_Y	(0)						// ウィンドウ初期値(縦)
#define SCREEN_WIDTH	(1280)					// ウインドウサイズ(横)
#define SCREEN_HEIGHT	(720)					// ウインドウサイズ(縦)
#define SCREEN_CENTER_X	(SCREEN_WIDTH / 2)		// ウインドウの中心Ｘ座標
#define SCREEN_CENTER_Y	(SCREEN_HEIGHT / 2)		// ウインドウの中心Ｙ座標
#define TEXTURE_WIDTH	(50)					// テクスチャサイズ(縦)
#define TEXTURE_HEIGHT	(50)					// テクスチャサイズ(横)
#define NUM_VERTEX      (4)						// 頂点数
#define NUM_POLYGON		(2)						// ポリゴン数
#define FVF_VERTEX_2D (D3DFVF_XYZRHW|D3DFVF_DIFFUSE|D3DFVF_TEX1)
//頂点フォーマット(頂点座標[2D]/頂点カラー/テクスチャ座標)

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
int FPS(void);

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	// 頂点座標
	float rhw;			// 座標変換用係数(1.0fで固定)
	D3DCOLOR col;		// 頂点カラー
	D3DXVECTOR2 tex;	// テクスチャ座標
}VERTEX_2D;


#endif






