//=============================================================================
//
// バックショット(拡散)処理 [buckshot.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _BUCK_SHOT_H_
#define _BUCK_SHOT_H_
//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"
#include "shots base.h"
//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_BUCK_SHOT (70)		//弾数

//=============================================================================
// クラス定義
//=============================================================================
class CBuckShot :public CShotsBase
{
public:
	CBuckShot();				// コンストラクタ
	~CBuckShot();				// デストラクタ	

	static CBuckShot*	Create(D3DXVECTOR3 pos);	// 生成処理
	HRESULT			Init(void);		// 初期化処理
	void			Uninit(void);	// 終了処理
	void			Update(void);	// 更新処理
	void			Shots(void);	// ショット処理
private:
	int	 m_nBullet;					// 発射するまでのカウント
	bool m_bBullet[MAX_BUCK_SHOT];		// 弾丸を撃ったか
};
#endif
