//=============================================================================
//
// クリア画面 [clear.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _ClEAR_H_
#define _ClEAR_H_
//=============================================================================
// ヘッダーファイル
//=============================================================================
#include "main.h"
#include "scene.h"

//=============================================================================
//  前方宣言
//=============================================================================
class CScene2d;
//=============================================================================
// クラス処理
//=============================================================================
class CClear :public CScene
{
public:
	CClear();						//コンストラクタ
	~CClear();						//デストラクタ

	static HRESULT	Load(void);		//テクスチャ読み込み
	static void		Unload(void);	//テクスチャの破棄
	static CClear	*Create(void);	//生成処理

	HRESULT			Init(void);		//初期化処理
	void			Uninit(void);	//終了処理
	void			Update(void);	//更新処理
	void			Draw(void);		//描画処理

private:

	static LPDIRECT3DTEXTURE9	m_apTexture;		//テクスチャへのポインタ
	CScene2d					*m_apScene2D;	//2Dポリゴンの数

	LPDIRECT3DVERTEXBUFFER9		m_pVtxBuff;					//頂点バッファへのポインタ
	int							m_nCounterAnim;				//アニメーションカウンター
	bool						m_bFade;
};



#endif