//=============================================================================
//
// 全方位ショット処理 [full range shots.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _FULL_RANGE_SHOTS_H_
#define _FULL_RANGE_SHOTS_H_
//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"
#include "shots base.h"
//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_FULL_RANGE (200)		//弾数

//=============================================================================
// クラス定義
//=============================================================================
class CFullRange :public CShotsBase
{
public:
	CFullRange();				// コンストラクタ
	~CFullRange();				// デストラクタ	

	static CFullRange*	Create(D3DXVECTOR3 pos);	// 生成処理
	HRESULT			Init(void);		// 初期化処理
	void			Uninit(void);	// 終了処理
	void			Update(void);	// 更新処理
	void			Shots(void);	// ショット処理
private:
	int	 m_nBullet;					// 発射するまでのカウント
	bool m_bBullet[MAX_FULL_RANGE];		// 弾丸を撃ったか
};
#endif
