//=============================================================================
//
// ショット処理 [shots.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _SHOTS_H_
#define _SHOTS_H_
//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"
#include "shots base.h"
//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_SHOTS (10)		//弾数

//=============================================================================
// クラス定義
//=============================================================================
class CShots :public CShotsBase
{
public:
	CShots();				// コンストラクタ
	~CShots();				// デストラクタ	

	static CShots*	Create(D3DXVECTOR3 pos);	// 生成処理
	HRESULT			Init(void);		// 初期化処理
	void			Uninit(void);	// 終了処理
	void			Update(void);	// 更新処理
	void			Shots(void);	// ショット処理
private:
	int	 m_nBullet;					// 発射するまでのカウント
	bool m_bBullet[MAX_SHOTS];		// 弾丸を撃ったか
};
#endif
