//=============================================================================
//
// ショット(円状)処理 [spira.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _SPIRAL_H_
#define _SPIRAL_H_
//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"
#include "shots base.h"
//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_SPIRAL (200)		//弾数
//=============================================================================
//前方宣言
//=============================================================================
class CScene2d;

//=============================================================================
// クラス定義
//=============================================================================
class CSpiral :public CShotsBase
{
public:
	CSpiral();				// コンストラクタ
	~CSpiral();				// デストラクタ	

	static CSpiral*	Create(CScene2d* Scene2d);	// 生成処理
	HRESULT			Init(void);		// 初期化処理
	void			Uninit(void);	// 終了処理
	void			Update(void);	// 更新処理
	void			Shots(void);	// ショット処理
private:
	CScene2d* m_pScene2d;			//オブジェクトのポインタ
	int	  m_nBullet;				// 発射するまでのカウント
	bool  m_bBullet[MAX_SPIRAL];	// 弾丸を撃ったか
};
#endif
