//=============================================================================
//
// ブロックベース [block base.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _BLOCK_BASE_H_
#define _BLOCK_BASE_H_
//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "model.h"
#include "object3d.h"
//=============================================================================
// マクロ定義
//=============================================================================
#define BLOCK_HEIGHT (25.0f)		//基本ブロックの高さ
//=============================================================================
// 前方宣言
//=============================================================================
class CModel;
//=============================================================================
// クラス定義
//=============================================================================
class CBlockBase : public CObject3D
{
public:
	CBlockBase();
	~CBlockBase();

	HRESULT Init(void);
	void	Uninit(void);
	void	Update(void);
	
	void	SetModelData(CModel::MODELDATA ModelData);	//モデルデータセッター

	CModel*GetModel(void) { return m_model; }
private:
	CModel*				m_model;		//モデルポインタ
	CModel::MODELDATA	m_modeldata;	//モデルデータ
};
#endif