//=============================================================================
//
// ビルブロック [building block.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _BUILDING_BLOCK_H_
#define _BUILDING_BLOCK_H_
//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "model.h"
#include "hindrance block base.h"
//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// 前方宣言
//=============================================================================
class CModel;
//=============================================================================
// クラス定義
//=============================================================================
class CBuildingBlock : public CHindranceBlockBase
{
public:
	CBuildingBlock();
	~CBuildingBlock();
	static CBuildingBlock*	Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size);
	HRESULT Init(void);
	void	Uninit(void);
	void	Update(void);
	void	Draw(void);
private:
	const int	 m_nModel = 50;					// モデル番号

};
#endif