//=============================================================================
//
//	ボタン[button.h]
//	Author:吉田　悠人
//
//=============================================================================

#ifndef _BUTTONP_H_
#define _BUTTONP_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"
#include "inputmouse.h"
#include "ui.h"

//=============================================================================
//前方宣言
//=============================================================================
typedef enum  //ボタンテクスチャ種類
{
	BUTTON_STATE_NORMAL = 0,
	BUTTON_STATE_OVER,
	BUTTON_STATE_MAX
}BUTTON_STATE;

//=============================================================================
// クラス定義
//=============================================================================
class CButton :public CUi
{
public:

	CButton(int nPriorit = PRIORITY_UI_0);	// コンストラクタ
	~CButton();								// デストラクタ

	HRESULT		 Init(void);			// 初期化処理
	void		 Over(void);			// 選択したとき
	void		 Out(void);				// 選択してないとき
	virtual void Push(void) = 0;		// プッシュ判定処理

private:

};
#endif
