//=============================================================================
//
// メイン処理 [input.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _INPUT_H_
#define _INPUT_H_
//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define NUM_KEY_MAX (256)    //キーボードの最大数

//=============================================================================
// クラス
//=============================================================================
class CInput
{
public:
    CInput();
    virtual ~CInput();
    virtual HRESULT Init(HINSTANCE hInstance, HWND hWnd);
    virtual void Uninit(void);
    virtual void Update(void) = 0;

protected:
    static LPDIRECTINPUT8	m_pInput;    //DirectInputオブジェクト
    LPDIRECTINPUTDEVICE8	m_pDeviceInput;
};

#endif
