//=============================================================================
//
// ライト処理 [light.cpp]
// Author : 吉田悠人
//
//=============================================================================

//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "light.h"
#include "main.h"
#include "manager.h"
#include "renderer.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CLight::CLight()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CLight::~CLight()
{
}

//=============================================================================
// 初期化関数
//=============================================================================
void CLight::Init(void)
{
	//デバイスへのポインタ
    LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetDevice();    
	//ライトの方向ベクトル
    D3DXVECTOR3 vecDir;    

	//ライトをクリアする
    ZeroMemory(&m_light, sizeof(D3DLIGHT9));
    //ライトの種類を設定
    m_light.Type = D3DLIGHT_DIRECTIONAL;
    //ライトの拡散光を設定
    m_light.Diffuse = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);
    m_light.Ambient = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);
    //ライトの方向を設定
    vecDir = D3DXVECTOR3(0.2f, -0.8f, -0.4f);
	//vecDir = D3DXVECTOR3(0.0f, -1.0f, 0.0f);

    D3DXVec3Normalize(&vecDir, &vecDir);    //正規化する（大きさ1のベクトルにする必要がある）
    m_light.Direction = vecDir;
    //ライトを設定する
    pDevice->SetLight(0, &m_light);
    //ライトを有効にする
    pDevice->LightEnable(0, TRUE);
}

//=============================================================================
// 終了関数
//=============================================================================
void CLight::Uninit(void)
{
}

//=============================================================================
// 更新関数
//=============================================================================
void CLight::Update(void)
{
}
