//=============================================================================
//
//	ポーズ画面背景[pause bg.h]
//	Author:吉田　悠人
//
//=============================================================================

#ifndef _PAUSE_BG_H_
#define _PAUSE_BG_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"
#include "ui.h"

//=============================================================================
// クラス定義
//=============================================================================
class CPauseBg :public CUi
{
public:

	CPauseBg(int nPriority = PRIORITY_UI_0);	// コンストラクタ
	~CPauseBg();								// デストラクタ
	static CPauseBg* Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);

	HRESULT	Init(void);			// 初期化処理
	void	Update(void);		// 更新処理
};
#endif
