//=============================================================================
//
// スコア処理 [score.h]
// Author : 吉田 悠人
//
//=============================================================================

#ifndef  _SCORE_H_
#define  _SCORE_H_
//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "main.h"
#include "object2d.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define MAX_SCORE (8)//スコアパネルの最大数

//=============================================================================
//前方宣言
//=============================================================================
class CUi;
class CNumber;
//=============================================================================
// クラス定義
//=============================================================================
class CScore :public CObject2D
{
public:
	CScore(int nPriorit = PRIORITY_UI_3);	// コンストラクタ
	~CScore();								// デストラクタ

	static CScore*	Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);	//生成処理

	HRESULT Init(void);		//初期化処理
	void	Uninit(void);	//終了処理
	void	Update(void);	//更新処理
	void	Draw(void);		//描画処理

	void	SetScore(int nScore);		// スコアセッター
	void	ColChange(D3DXCOLOR col);	// カラーチェンジ
	void	AddScore(int nValue);		// スコアプラス
	int		GetScore(void);				// スコアゲッター

private:
	CNumber*	m_apNumber[MAX_SCORE];	// ナンバークラス
	int			m_nScore;				// スコア
};
#endif