//=============================================================================
//
//	セリフNo8 [talk no8.cpp]
//	Author:筒井 俊稀
//
//=============================================================================

//=============================================================================
// インクルードファイル
//=============================================================================
#include "talk_base.h"
#include "resource manager.h"
#include "inputkeyboard.h"
#include "inputcontroller.h"
#include "renderer.h"
#include "manager.h"
#include "sound.h"
#include "talk no8.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// コンストラクタ
//=============================================================================
CTalkNo8::CTalkNo8(int nPriorit)
{
}

//=============================================================================
// 生成処理
//=============================================================================
CTalkNo8 * CTalkNo8::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	//メモリ確保
	CTalkNo8* pTalkNo8 = nullptr;
	pTalkNo8 = new CTalkNo8;
	//リソース確保
	CResource* pResource = CManager::GetResource();
	LPDIRECT3DTEXTURE9 Texture = pResource->TextureLoad(pTalkNo8->m_nTexture);

	//NULLチェック
	if (pTalkNo8 != nullptr)
	{
		//位置設定
		pTalkNo8->SetPos(pos);
		//サイズ設定
		pTalkNo8->SetSize(size);
		//テクスチャ設定
		pTalkNo8->BindTexture(Texture);
		//初期化処理
		pTalkNo8->Init();
	}
	return pTalkNo8;
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CTalkNo8::Init(void)
{
	//出現している時間セット
	SetAppear(0);
	//フェード状況設定
	SetFade(FADE_IN);

	//初期化処理
	CTalkbase::Init();
	return S_OK;
}

//=============================================================================
// 更新処理
//=============================================================================
void CTalkNo8::Update(void)
{
	CTalkbase::Update();
}

//=============================================================================
// トーク処理
//=============================================================================
void CTalkNo8::Talk(void)
{

}
