//=============================================================================
//
//	セリフNo4 [talk no4.cpp]
//	Author:筒井 俊稀
//
//=============================================================================

//=============================================================================
// インクルードファイル
//=============================================================================
#include "talk_base.h"
#include "resource manager.h"
#include "inputkeyboard.h"
#include "inputcontroller.h"
#include "renderer.h"
#include "manager.h"
#include "sound.h"
#include "talk no4.h"
#include "child.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// コンストラクタ
//=============================================================================
CTalkNo4::CTalkNo4(int nPriorit)
{
}

//=============================================================================
// 生成処理
//=============================================================================
CTalkNo4 * CTalkNo4::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	//メモリ確保
	CTalkNo4* pTalkNo4 = nullptr;
	pTalkNo4 = new CTalkNo4;
	//リソース確保
	CResource* pResource = CManager::GetResource();
	LPDIRECT3DTEXTURE9 Texture = pResource->TextureLoad(pTalkNo4->m_nTexture);

	//NULLチェック
	if (pTalkNo4 != nullptr)
	{
		//位置設定
		pTalkNo4->SetPos(pos);
		//サイズ設定
		pTalkNo4->SetSize(size);
		//テクスチャ設定
		pTalkNo4->BindTexture(Texture);
		//初期化処理
		pTalkNo4->Init();
	}
	return pTalkNo4;
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CTalkNo4::Init(void)
{
	//出現している時間セット
	SetAppear(0);
	//フェード状況設定
	SetFade(FADE_IN);

	//初期化処理
	CTalkbase::Init();
	return S_OK;
}

//=============================================================================
// 更新処理
//=============================================================================
void CTalkNo4::Update(void)
{
	CTalkbase::Update();
}

//=============================================================================
// トーク処理
//=============================================================================
void CTalkNo4::Talk(void)
{
	//子供(プレイヤーのくっついてるブロック)ポインタ処理
	CChild * pChild = (CChild*)(GetTop()[PRIORITY_OBJECT_CHILD]);
	while (pChild != NULL)
	{
		//何かにくっついている
		if (!pChild->GetIsActive())
		{
			//透過状況を設定
			m_Fade = FADE_OUT;
		}
		pChild = (CChild*)(pChild->GetNext());
	}
}
