//=============================================================================
//
//	セリフNo.1[talk no1.h]
//	Author:筒井　俊稀
//
//=============================================================================

// 二重インクルード防止
#ifndef _TALK_NO1_H_
#define _TALK_NO1_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"
#include "talk_base.h"

//=============================================================================
// クラス定義
//=============================================================================
class CTalkNo1 :public CTalkbase
{
public:


	CTalkNo1(int nPriorit = PRIORITY_UI_0);	// コンストラクタ
	static CTalkNo1* Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);
	HRESULT		Init(void);				// 初期化処理
	void		Update(void);			// 更新処理

protected:
	const int m_nTexture = 10;			// テクスチャ番号

};
#endif
