//=============================================================================
//
//	uiヘッダ [ui.h]
//	Author : 筒井　俊稀
//
//=============================================================================

//二重インクルード防止
#ifndef _UI_H_
#define _UI_H_

//====================================
//インクルード
//====================================
#include "main.h"
#include "object2d.h"

//====================================
// マクロ定義
//====================================

//====================================
// クラス定義
//====================================
//UIクラス
class CUi : public CObject2D
{
public:
	CUi(int nPriorit = PRIORITY_UI_0);
	~CUi();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
};
#endif // !_UI_H_
