//=============================================================================
//
// エネミータイプ3処理 [enemy type3.h]
// Author : 吉田悠人
//
//=============================================================================

#ifndef _ENEMY_TYPE_3_H_
#define _ENEMY_TYPE_3_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"
#include "enemy base.h"
//=============================================================================
//前方宣言
//=============================================================================

//=============================================================================
// クラス定義
//=============================================================================
class CEnemyType3 :public CEnemyBase
{
public:
	CEnemyType3(int nPriorit = PRIORITY_OBJECT_1);	//コンストラクタ
	~CEnemyType3();									//デストラクタ	

	static HRESULT		Load(void);					// テクスチャ読み込み
	static void			Unload(void);				// テクスチャの破棄
	static CEnemyType3*	Create(D3DXVECTOR3 pos, ENEMY_PATTERN Type);	// 生成処理

	HRESULT Init(void);				// 初期化処理
	void	Uninit(void);			// 終了処理
	void	Update(void);			// 更新処理
	void	Draw(void);				// 描画処理
private:
	static TEXTURE_DATA	m_TextureData;					// テクスチャデータ

};
#endif