//=============================================================================
//
// エネミータイプ3処理 [enemy type3.cpp]
// Author : 吉田悠人
//
//=============================================================================
//=============================================================================
//インクルードファイル
//=============================================================================
#include "enemy type3.h"
#include "manager.h"
#include "renderer.h"
//=============================================================================
// マクロ定義
//=============================================================================
#define TYPE1_SIZE	(100.0f)	//サイズ
#define TYPE1_LIFE	(2)			//ライフ
#define TYPE1_SCORE (100)		//スコア
//=============================================================================
// 静的メンバー変数
//=============================================================================
TEXTURE_DATA CEnemyType3::m_TextureData = { NULL,"data/TEXTURE/Enemy_3.png", };
//=============================================================================
// コンストラクト
//=============================================================================
CEnemyType3::CEnemyType3(int nPriorit)
{
}
//=============================================================================
// デストラクト
//=============================================================================
CEnemyType3::~CEnemyType3()
{
}

//=============================================================================
// テクスチャロード処理
//=============================================================================
HRESULT CEnemyType3::Load(void)
{
	//デバイス取得
	LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetObjects();
	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice, m_TextureData.m_cFileName, &m_TextureData.m_Texture);
	return S_OK;
}

//=============================================================================
// テクスチャ破棄処理
//=============================================================================
void CEnemyType3::Unload(void)
{
	//テクスチャの破棄
	if (m_TextureData.m_Texture != NULL)
	{
		m_TextureData.m_Texture->Release();
		m_TextureData.m_Texture = NULL;
	}
}

//=============================================================================
// 生成処理
//=============================================================================
CEnemyType3 * CEnemyType3::Create(D3DXVECTOR3 pos, ENEMY_PATTERN Type)
{
	//メモリ確保
	CEnemyType3* pEnemyType3;
	pEnemyType3 = new CEnemyType3;
	//位置設定
	pEnemyType3->SetPos(pos);
	//サイズ設定
	pEnemyType3->SetSize(D3DXVECTOR3(TYPE1_SIZE / 2.0f, TYPE1_SIZE / 2.0f, 0.0f));
	//ライフ設定
	pEnemyType3->SetLife(TYPE1_LIFE);
	//スコア設定
	pEnemyType3->SetScore(TYPE1_SCORE);
	//タイプセット
	pEnemyType3->SetPattern(Type);
	//テクスチャセット
	pEnemyType3->BindTexture(m_TextureData.m_Texture);
	//初期化処理
	pEnemyType3->Init();
	return pEnemyType3;
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CEnemyType3::Init(void)
{
	CEnemyBase::Init();
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CEnemyType3::Uninit(void)
{
	CEnemyBase::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CEnemyType3::Update(void)
{
	//攻撃処理
	Bullet();

	CEnemyBase::Update();
}

//=============================================================================
// 描画処理
//=============================================================================
void CEnemyType3::Draw(void)
{
	CEnemyBase::Draw();
}
