//=============================================================================
//
// フェード処理 [fade.h]
// Author : 吉田悠人
//
//=============================================================================

#ifndef _FADE_H
#define _FADE_H
//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_FADE	(3)
#define FADE_RATE	(0.03f)

//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include"main.h"
#include"manager.h"

//=============================================================================
// フェードクラス
//=============================================================================
class CFade
{
public:
	typedef enum
	{
		FADE_NONE = 0,		//何もない状態
		FADE_IN,			//フェード処理
		FADE_OUT,			//フェードアウト処理
		FADE_MAX
	}FADE;

	CFade();
	~CFade();
	static CFade *Create(void);		// 作成処理
	HRESULT Init(void);
	void	Uninit(void);
	void	Update(void);
	void	Draw(void);
	void	SetFade(GAME_MODE mode);		// フェード設定
private:
	LPDIRECT3DVERTEXBUFFER9		m_pVtxBuff;	//頂点バッファへのポインタ
	D3DXVECTOR3 m_pos;						// 位置
	GAME_MODE	m_ModeNext;					//次の画面（モード）
	D3DXCOLOR	m_Color;				//フェード色
	FADE		m_Fade;					//フェード状態
};

#endif