//=============================================================================
//
//	プレイヤーデータ[player data.h]
//	Author:吉田　悠人
//
//=============================================================================

#ifndef _PLAYER_DATA_H_
#define _PLAYER_DATA_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"
#include "player.h"

//=============================================================================
//前方宣言
//=============================================================================

//=============================================================================
// クラス定義
//=============================================================================
class CPlayerData
{
public:
	CPlayerData();	// コンストラクタ
	~CPlayerData();	// デストラクタ

	static CPlayerData*	Create(void);					// 生成処理
	void			Uninit(void);					// 終了処理

	void		SetLifeData(int nLife);				// ライフデータセッター
	void		SetSpeedData(float fSpeed);			// スピードデータセッター
	void		SetWeaponData(WEAPON_DATA wepon);	// ウェポンデータセッター

	int			GetLifeData(void);					// ライフデータゲッター
	float		GetSpeedData(void);					// スピードデータゲッター
	WEAPON_DATA GetWeaponData(void);				// ウェポンデータゲッター	

private:
	int					m_nLifeData;		// ライフデータ
	float				m_fSpeedData;		// スピードデータ
	WEAPON_DATA			m_WeaponData;		// 装備中武装データ
};
#endif
