//=============================================================================
//
// ステージ2処理 [stage_2.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _STAGE_2_H_
#define _STAGE_2_H_

//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "main.h"
#include "game.h"
#include "stage.h"
//=============================================================================
//前方宣言
//=============================================================================
class CEnemy;

//=============================================================================
// クラス定義
//=============================================================================
class CStage2 :public CStage
{
public:

	CStage2();	//コンストラクタ
	~CStage2();	//デストラクタ
	static CStage2*	Create(void);	//生成処理

	HRESULT	Init(void);		// 初期化処理
	void	Uninit(void);	// 終了処理
	void	Update(void);	// 更新処理
	void	StageMode(void);	// ステージの進行
	void	EnemyCreate(void);	// エネミーの生成
	void	BossCreate(void);	// ボス生成
private:
	STAGE_ENEMY	m_EnemyCreate;		//エネミーの出現モード
	STAGE_DATA	m_StageData;		//エネミーの出現データ
	int			m_nBossPhase;		//ボス出現データ

};


#endif