//=============================================================================
//
// タイトル処理 [title.cpp]
// Author : 吉田悠人
//
//=============================================================================
//=============================================================================
//インクルードファイル
//=============================================================================
#include "title.h"
#include "sound.h"
#include "fade.h"
#include "inputmouse.h"
#include "title bg.h"
//=============================================================================
// コンストラクタ
//=============================================================================
CTitle::CTitle()
{
	m_pTitleBg = NULL;
}

//=============================================================================
// デストラクタ
//=============================================================================
CTitle::~CTitle()
{
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CTitle::Init(void)
{
	CSound*	pSound = CManager::GetSound();	//サウンド取得

	//タイトル生成
	m_pTitleBg = CTitleBg::Create();
	//サウンド再生
	pSound->Play(CSound::LABEL_BGM_TITLE);
	
	//ここまで
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CTitle::Uninit(void)
{
	//シーン破棄
	CScene::ReleaseAll();
}

//=============================================================================
// 更新処理
//=============================================================================
void CTitle::Update(void)
{
	CSound*		pSound	= CManager::GetSound();	//サウンド取得
	CInihMouse*	pMouse	= CManager::GetMouse();	//マウス取得
	CFade*		pFade	= CManager::GetFade();	//フェードポインタ取得

	//マウスを左クリック
	if (pMouse->GetClickTrigger(0) == true)
	{
		//NULLチェック
		if (pSound!=NULL)
		{
			//SE再生
			pSound->Play(CSound::LABEL_SE_CLICK);
		}
		//NULLチェック
		if (pFade != NULL)
		{
			//画面転換
			pFade->SetFade(GAME_MODE_SELECT);
		}
	}
	//マウスを右クリック
	else if (pMouse->GetClickTrigger(1) == true)
	{
		//NULLチェック
		if (pSound != NULL)
		{
			//SE再生
			pSound->Play(CSound::LABEL_SE_CLICK);
		}
		//NULLチェック
		if (pFade != NULL)
		{
			//画面転換
			pFade->SetFade(GAME_MODE_TUTORIAL);
		}
	}

}

//=============================================================================
// 描画関数
//=============================================================================
void CTitle::Draw(void)
{
}
